[
  {
    "name": "spo-list-contenttype-migration",
    "source": "pnp",
    "title": "SharePoint List Content Type Migration with Data Preservation",
    "shortDescription": "Migrate SharePoint list to new content type while preserving all existing data",
    "url": "https://pnp.github.io/script-samples/spo-list-contenttype-migration/README.html",
    "longDescription": [
      "This PowerShell script demonstrates how to migrate a SharePoint list to use a different content type while preserving all existing data. The script backs up existing column data, removes old columns, applies a PnP provisioning template with the new content type, and restores all data to the new columns. Perfect for scenarios where you need to replace existing columns with new ones from a content type without losing any data."
    ],
    "creationDateTime": "2025-07-29",
    "updateDateTime": "2025-07-29",
    "products": [
      "SharePoint"
    ],
    "metadata": [
      {
        "key": "PNP-POWERSHELL",
        "value": "3.1.0"
      }
    ],
    "categories": [
      "Modernize",
      "Data",
      "Migration"
    ],
    "tags": [
      "Connect-PnPOnline",
      "Set-PnPList",
      "Get-PnPListItem",
      "Remove-PnPField",
      "Invoke-PnPSiteTemplate",
      "Get-PnPContentType",
      "Add-PnPContentTypeToList",
      "Set-PnPListItem",
      "Disconnect-PnPOnline"
    ],
    "thumbnails": [
      {
        "type": "image",
        "order": 100,
        "url": "https://raw.githubusercontent.com/pnp/script-samples/main/scripts/spo-list-contenttype-migration/assets/preview.png",
        "alt": "Preview of SharePoint List Content Type Migration with Data Preservation"
      }
    ],
    "authors": [
      {
        "gitHubAccount": "jeppesc11",
        "company": "",
        "pictureUrl": "https://github.com/jeppesc11.png",
        "name": "Jeppe Spanggaard"
      }
    ],
    "references": [
{
        "name": "Want to learn more about PnP PowerShell and the cmdlets",
        "description": "Check out the PnP PowerShell site to get started and for the reference to the cmdlets.",
        "url": "https://aka.ms/pnp/powershell"
      },      
      {
        "name": "Want to learn more about CLI for Microsoft 365 and the commands",
        "description": "Check out the CLI for Microsoft 365 site to get started and for the reference to the commands.",
        "url": "https://aka.ms/cli-m365"
      },
      {
        "name": "Want to learn more about Microsoft Graph PowerShell SDK and the cmdlets",
        "description": "Check out the Microsoft Graph PowerShell SDK documentation site to get started and for the reference to the cmdlets.",
        "url": "https://learn.microsoft.com/graph/powershell/get-started"
      },
      {
        "name": "Want to learn more about Power Apps PowerShell and the cmdlets",
        "description": "Check out the Power Apps PowerShell documentation site to get started and for the reference to the cmdlets.",
        "url": "https://learn.microsoft.com/power-platform/admin/powerapps-powershell"
      },
      {
        "name": "Introduction to the SharePoint Online Management Shell",
        "description": "Check out the SPO Management Shell documentation site to get started and for the reference to the cmdlets.",
        "url": "https://learn.microsoft.com/powershell/sharepoint/sharepoint-online/introduction-sharepoint-online-management-shell"
      },
      {
        "name": "Want to learn more about Microsoft Teams PowerShell and the cmdlets",
        "description": "Check out the Microsoft Teams PowerShell documentation site to get started and for the reference to the cmdlets.",
        "url": "https://learn.microsoft.com/microsoftteams/teams-powershell-overview"
      },
      {
        "name": "Want to learn more about Azure CLI and the commands",
        "description": "Check out the Azure CLI documentation site to get started and for the reference to the commands.",
        "url": "https://learn.microsoft.com/cli/azure/"
      },
      {
        "name":"Want to learn more about Whiteboard Admin cmdlets",
        "description":"Check out the Whiteboard Admin cmdlets documentation site to get started and for the reference to the commands.",
        "url": "https://learn.microsoft.com/powershell/module/whiteboard"
      },
      {
        "name":"Want to learn more about Teams Toolkit CLI",
        "description":"Check out the documentation site to get started and for the reference on performing operations on agents",
        "url": "https://learn.microsoft.com/en-us/microsoftteams/platform/toolkit/teams-toolkit-cli?pivots=version-three"
      }
    ]
  }
]
